<?php
    echo '<h1 align = "center">Приветствую!</h1>'
?>
<html lang="ru">
<style> 
.image-center {
  display:block;
  margin: auto;
}
.brd {
        border: 4px ; 
        background: #EBF4FA; 
        padding: 10px; 
        margin: 30px; 
       }
table {
        border: solid 1px;
         border-collapse: collapse;
        }

td, th {
        border: solid 4px;
        border-color: #EBF4FA;
        padding: 10px;
        }

th {
        background-color: #F0FFFF;
      }
      
.P {
 border: solid 4px;
 border-color: #EBF4FA;
 padding: 5px;
 margin: 10px;  
}
</style>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Биография Александры Грешновой</title>
    <p><a name="up"> </a> </p>
</head>
<body bgcolor = '#e1cadc'>
    <h2 align = "center">Вы зашли на сайт, посвященный Александре Грешновой</h2>
    <p><a name="foto"></a>
    <img src="muyFDXvw5Wg.jpg" alt="Александра Грешнова" height="350px" class="image-center"/> 
    <div class="brd">
    <h3>Навигация по странице: </h3>
  <ol>
    <li><a href="#bio">Биография</a></li>
    <li><a href="#life">Личная жизнь</a></li>
    <li><a href="#facts">Интересные факты</a></li>
    <li><a href="#down">Вниз</a></li>
  </ol>
  </div>
  <div class="p">
  <p><a name="bio"> <h3>Биография</h3> </a>
Грешнова Александра Евгеньевна родилась 3 июня 2000 года в городе Ульяновске. Родители Александры: Грешнов Евгений Алксандрович и Грешнова (Ильина) Эльвира Анатолевна. 
С детства Александра была очень сообразительная и умная. Уже в детском саду Саша начала проявлять свои способности: отличная учеба, участие в детских утренках, выступление на праздниках для младшх групп.<br>
Школа, в которую пошла Александра, находилась рядом с домом. Участвовала в олимпиадах, ходила на балет, занималась легкой атлетикой.<br>
В 2011 году с семьей переехала в другой район, из-за чего прилось сменить место учебы. Закончив 4 класс, перешла в специальный военный класс, основанный в её школе. До 9 класс училась в этом классе и планировала продолжить военную службу в дальнейшем.
За пять лет дослужилась до звания младшего сержанта. Прошла курс военной подготовки, также получила хороший навык стрельбы.<br>
В 8 классе начала изучать информатику и решила связать свою жизнь с прогаммированием. В 2018 году, после успешнй сдачи экзаменов, поступила в Ульяновскй Государственный технический университет.
</div>

  <table  border="1" width="50%" cellpadding="4">
  <caption> Таблица о местах обучения</caption>
   <tr>
    <th>Место обучения</th>
    <th>Годы обучения</th>
   </tr>
   <tr>
    <td> Детский сад №224 "Семицветик" </td>
    <td>2003-2007</td>
  </tr>
  <tr>
    <td>МБОУ СШ №61</td>
    <td>2007-2011</td>
  </tr>
  <tr>
    <td>МБОУ СШ №28</td>
    <td>2011-2018</td>
  </tr>
  <tr>
    <td>Ульяновский государственный технический университет</td>
    <td>2018-2022</td>
  </tr>
 </table>
  </p>

  <hr/>
  <div class="p">
  <p><a name="life"> <h3>Личная жизнь</h3> </a>
  <img src="s1200.jpg" alt="пусто" height="200px"/> 
  
  </p>
  </div>
  <hr/>
  <div class="p">
  <p><a name="facts"> <h3>Интересные факты</h3> </a>
  <ul>
    <li>Любит грузть лёд, но из-за бректов лишена данной возможности</li>
    <li>Никогда ничего себе не ломала</li>
    <li>Любит кошек больше, чем собак. Но главные фавориты - рыбки</li>
    <li>Может спать больше 15 часов в сутки</li>
    <li>Умеет вязать крючком и спицами</li>
    <li>Очень сильно укачивает в транспорте</li>
    <li>Любимое блюдо - мамин жульен</li>
    <li>Любимый фильм - Ла-Ла-Лэнд</li>
    <li>Чай или кофе? Кофе!</li>
    <li>Я: Александра Евгеньена<br> Отец: Евгений Александрович<br> Дедушка: Александр Евгеньевич<br>Семейная традиция семьи Грешновых</li>
    <li>Ненавидит молоко и оливки</li>
    
  </ul>
  </p>
  </div>
  <hr/>

<p><a name="down"> </a></p>
  <div class="brd">
    <h3>Навигация по странице: </h3>
  <ol>
    <li><a href="#foto">Фотография</a></li>
    <li><a href="#bio">Биография</a></li>
    <li><a href="#life">Личная жизнь</a></li>
    <li><a href="#facts">Интересные факты</a></li>
    <li><a href="#up"> Наверх</a></li>
  </ol>
  </div>
</body>
</html>